grevaillot/svd_tools/headers/ATSAM4S2C/pioc.h
/** @defgroup pioc_mddr MDDR Multi-driver Disable Register
@{*/

/** PIOC_MDDR_P31 Multi-drive Disable **/
#define PIOC_MDDR_P31		(1 << 31)
/** PIOC_MDDR_P30 Multi-drive Disable **/
#define PIOC_MDDR_P30		(1 << 30)
/** PIOC_MDDR_P29 Multi-drive Disable **/
#define PIOC_MDDR_P29		(1 << 29)
/** PIOC_MDDR_P28 Multi-drive Disable **/
#define PIOC_MDDR_P28		(1 << 28)
/** PIOC_MDDR_P27 Multi-drive Disable **/
#define PIOC_MDDR_P27		(1 << 27)
/** PIOC_MDDR_P26 Multi-drive Disable **/
#define PIOC_MDDR_P26		(1 << 26)
/** PIOC_MDDR_P25 Multi-drive Disable **/
#define PIOC_MDDR_P25		(1 << 25)
/** PIOC_MDDR_P24 Multi-drive Disable **/
#define PIOC_MDDR_P24		(1 << 24)
/** PIOC_MDDR_P23 Multi-drive Disable **/
#define PIOC_MDDR_P23		(1 << 23)
/** PIOC_MDDR_P22 Multi-drive Disable **/
#define PIOC_MDDR_P22		(1 << 22)
/** PIOC_MDDR_P21 Multi-drive Disable **/
#define PIOC_MDDR_P21		(1 << 21)
/** PIOC_MDDR_P20 Multi-drive Disable **/
#define PIOC_MDDR_P20		(1 << 20)
/** PIOC_MDDR_P19 Multi-drive Disable **/
#define PIOC_MDDR_P19		(1 << 19)
/** PIOC_MDDR_P18 Multi-drive Disable **/
#define PIOC_MDDR_P18		(1 << 18)
/** PIOC_MDDR_P17 Multi-drive Disable **/
#define PIOC_MDDR_P17		(1 << 17)
/** PIOC_MDDR_P16 Multi-drive Disable **/
#define PIOC_MDDR_P16		(1 << 16)
/** PIOC_MDDR_P15 Multi-drive Disable **/
#define PIOC_MDDR_P15		(1 << 15)
/** PIOC_MDDR_P14 Multi-drive Disable **/
#define PIOC_MDDR_P14		(1 << 14)
/** PIOC_MDDR_P13 Multi-drive Disable **/
#define PIOC_MDDR_P13		(1 << 13)
/** PIOC_MDDR_P12 Multi-drive Disable **/
#define PIOC_MDDR_P12		(1 << 12)
/** PIOC_MDDR_P11 Multi-drive Disable **/
#define PIOC_MDDR_P11		(1 << 11)
/** PIOC_MDDR_P10 Multi-drive Disable **/
#define PIOC_MDDR_P10		(1 << 10)
/** PIOC_MDDR_P9 Multi-drive Disable **/
#define PIOC_MDDR_P9		(1 << 9)
/** PIOC_MDDR_P8 Multi-drive Disable **/
#define PIOC_MDDR_P8		(1 << 8)
/** PIOC_MDDR_P7 Multi-drive Disable **/
#define PIOC_MDDR_P7		(1 << 7)
/** PIOC_MDDR_P6 Multi-drive Disable **/
#define PIOC_MDDR_P6		(1 << 6)
/** PIOC_MDDR_P5 Multi-drive Disable **/
#define PIOC_MDDR_P5		(1 << 5)
/** PIOC_MDDR_P4 Multi-drive Disable **/
#define PIOC_MDDR_P4		(1 << 4)
/** PIOC_MDDR_P3 Multi-drive Disable **/
#define PIOC_MDDR_P3		(1 << 3)
/** PIOC_MDDR_P2 Multi-drive Disable **/
#define PIOC_MDDR_P2		(1 << 2)
/** PIOC_MDDR_P1 Multi-drive Disable **/
#define PIOC_MDDR_P1		(1 << 1)
/** PIOC_MDDR_P0 Multi-drive Disable **/
#define PIOC_MDDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_mdsr MDSR Multi-driver Status Register
@{*/

/** PIOC_MDSR_P31 Multi-drive Status **/
#define PIOC_MDSR_P31		(1 << 31)
/** PIOC_MDSR_P30 Multi-drive Status **/
#define PIOC_MDSR_P30		(1 << 30)
/** PIOC_MDSR_P29 Multi-drive Status **/
#define PIOC_MDSR_P29		(1 << 29)
/** PIOC_MDSR_P28 Multi-drive Status **/
#define PIOC_MDSR_P28		(1 << 28)
/** PIOC_MDSR_P27 Multi-drive Status **/
#define PIOC_MDSR_P27		(1 << 27)
/** PIOC_MDSR_P26 Multi-drive Status **/
#define PIOC_MDSR_P26		(1 << 26)
/** PIOC_MDSR_P25 Multi-drive Status **/
#define PIOC_MDSR_P25		(1 << 25)
/** PIOC_MDSR_P24 Multi-drive Status **/
#define PIOC_MDSR_P24		(1 << 24)
/** PIOC_MDSR_P23 Multi-drive Status **/
#define PIOC_MDSR_P23		(1 << 23)
/** PIOC_MDSR_P22 Multi-drive Status **/
#define PIOC_MDSR_P22		(1 << 22)
/** PIOC_MDSR_P21 Multi-drive Status **/
#define PIOC_MDSR_P21		(1 << 21)
/** PIOC_MDSR_P20 Multi-drive Status **/
#define PIOC_MDSR_P20		(1 << 20)
/** PIOC_MDSR_P19 Multi-drive Status **/
#define PIOC_MDSR_P19		(1 << 19)
/** PIOC_MDSR_P18 Multi-drive Status **/
#define PIOC_MDSR_P18		(1 << 18)
/** PIOC_MDSR_P17 Multi-drive Status **/
#define PIOC_MDSR_P17		(1 << 17)
/** PIOC_MDSR_P16 Multi-drive Status **/
#define PIOC_MDSR_P16		(1 << 16)
/** PIOC_MDSR_P15 Multi-drive Status **/
#define PIOC_MDSR_P15		(1 << 15)
/** PIOC_MDSR_P14 Multi-drive Status **/
#define PIOC_MDSR_P14		(1 << 14)
/** PIOC_MDSR_P13 Multi-drive Status **/
#define PIOC_MDSR_P13		(1 << 13)
/** PIOC_MDSR_P12 Multi-drive Status **/
#define PIOC_MDSR_P12		(1 << 12)
/** PIOC_MDSR_P11 Multi-drive Status **/
#define PIOC_MDSR_P11		(1 << 11)
/** PIOC_MDSR_P10 Multi-drive Status **/
#define PIOC_MDSR_P10		(1 << 10)
/** PIOC_MDSR_P9 Multi-drive Status **/
#define PIOC_MDSR_P9		(1 << 9)
/** PIOC_MDSR_P8 Multi-drive Status **/
#define PIOC_MDSR_P8		(1 << 8)
/** PIOC_MDSR_P7 Multi-drive Status **/
#define PIOC_MDSR_P7		(1 << 7)
/** PIOC_MDSR_P6 Multi-drive Status **/
#define PIOC_MDSR_P6		(1 << 6)
/** PIOC_MDSR_P5 Multi-drive Status **/
#define PIOC_MDSR_P5		(1 << 5)
/** PIOC_MDSR_P4 Multi-drive Status **/
#define PIOC_MDSR_P4		(1 << 4)
/** PIOC_MDSR_P3 Multi-drive Status **/
#define PIOC_MDSR_P3		(1 << 3)
/** PIOC_MDSR_P2 Multi-drive Status **/
#define PIOC_MDSR_P2		(1 << 2)
/** PIOC_MDSR_P1 Multi-drive Status **/
#define PIOC_MDSR_P1		(1 << 1)
/** PIOC_MDSR_P0 Multi-drive Status **/
#define PIOC_MDSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pudr PUDR Pull-up Disable Register
@{*/

/** PIOC_PUDR_P31 Pull-Up Disable **/
#define PIOC_PUDR_P31		(1 << 31)
/** PIOC_PUDR_P30 Pull-Up Disable **/
#define PIOC_PUDR_P30		(1 << 30)
/** PIOC_PUDR_P29 Pull-Up Disable **/
#define PIOC_PUDR_P29		(1 << 29)
/** PIOC_PUDR_P28 Pull-Up Disable **/
#define PIOC_PUDR_P28		(1 << 28)
/** PIOC_PUDR_P27 Pull-Up Disable **/
#define PIOC_PUDR_P27		(1 << 27)
/** PIOC_PUDR_P26 Pull-Up Disable **/
#define PIOC_PUDR_P26		(1 << 26)
/** PIOC_PUDR_P25 Pull-Up Disable **/
#define PIOC_PUDR_P25		(1 << 25)
/** PIOC_PUDR_P24 Pull-Up Disable **/
#define PIOC_PUDR_P24		(1 << 24)
/** PIOC_PUDR_P23 Pull-Up Disable **/
#define PIOC_PUDR_P23		(1 << 23)
/** PIOC_PUDR_P22 Pull-Up Disable **/
#define PIOC_PUDR_P22		(1 << 22)
/** PIOC_PUDR_P21 Pull-Up Disable **/
#define PIOC_PUDR_P21		(1 << 21)
/** PIOC_PUDR_P20 Pull-Up Disable **/
#define PIOC_PUDR_P20		(1 << 20)
/** PIOC_PUDR_P19 Pull-Up Disable **/
#define PIOC_PUDR_P19		(1 << 19)
/** PIOC_PUDR_P18 Pull-Up Disable **/
#define PIOC_PUDR_P18		(1 << 18)
/** PIOC_PUDR_P17 Pull-Up Disable **/
#define PIOC_PUDR_P17		(1 << 17)
/** PIOC_PUDR_P16 Pull-Up Disable **/
#define PIOC_PUDR_P16		(1 << 16)
/** PIOC_PUDR_P15 Pull-Up Disable **/
#define PIOC_PUDR_P15		(1 << 15)
/** PIOC_PUDR_P14 Pull-Up Disable **/
#define PIOC_PUDR_P14		(1 << 14)
/** PIOC_PUDR_P13 Pull-Up Disable **/
#define PIOC_PUDR_P13		(1 << 13)
/** PIOC_PUDR_P12 Pull-Up Disable **/
#define PIOC_PUDR_P12		(1 << 12)
/** PIOC_PUDR_P11 Pull-Up Disable **/
#define PIOC_PUDR_P11		(1 << 11)
/** PIOC_PUDR_P10 Pull-Up Disable **/
#define PIOC_PUDR_P10		(1 << 10)
/** PIOC_PUDR_P9 Pull-Up Disable **/
#define PIOC_PUDR_P9		(1 << 9)
/** PIOC_PUDR_P8 Pull-Up Disable **/
#define PIOC_PUDR_P8		(1 << 8)
/** PIOC_PUDR_P7 Pull-Up Disable **/
#define PIOC_PUDR_P7		(1 << 7)
/** PIOC_PUDR_P6 Pull-Up Disable **/
#define PIOC_PUDR_P6		(1 << 6)
/** PIOC_PUDR_P5 Pull-Up Disable **/
#define PIOC_PUDR_P5		(1 << 5)
/** PIOC_PUDR_P4 Pull-Up Disable **/
#define PIOC_PUDR_P4		(1 << 4)
/** PIOC_PUDR_P3 Pull-Up Disable **/
#define PIOC_PUDR_P3		(1 << 3)
/** PIOC_PUDR_P2 Pull-Up Disable **/
#define PIOC_PUDR_P2		(1 << 2)
/** PIOC_PUDR_P1 Pull-Up Disable **/
#define PIOC_PUDR_P1		(1 << 1)
/** PIOC_PUDR_P0 Pull-Up Disable **/
#define PIOC_PUDR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_puer PUER Pull-up Enable Register
@{*/

/** PIOC_PUER_P31 Pull-Up Enable **/
#define PIOC_PUER_P31		(1 << 31)
/** PIOC_PUER_P30 Pull-Up Enable **/
#define PIOC_PUER_P30		(1 << 30)
/** PIOC_PUER_P29 Pull-Up Enable **/
#define PIOC_PUER_P29		(1 << 29)
/** PIOC_PUER_P28 Pull-Up Enable **/
#define PIOC_PUER_P28		(1 << 28)
/** PIOC_PUER_P27 Pull-Up Enable **/
#define PIOC_PUER_P27		(1 << 27)
/** PIOC_PUER_P26 Pull-Up Enable **/
#define PIOC_PUER_P26		(1 << 26)
/** PIOC_PUER_P25 Pull-Up Enable **/
#define PIOC_PUER_P25		(1 << 25)
/** PIOC_PUER_P24 Pull-Up Enable **/
#define PIOC_PUER_P24		(1 << 24)
/** PIOC_PUER_P23 Pull-Up Enable **/
#define PIOC_PUER_P23		(1 << 23)
/** PIOC_PUER_P22 Pull-Up Enable **/
#define PIOC_PUER_P22		(1 << 22)
/** PIOC_PUER_P21 Pull-Up Enable **/
#define PIOC_PUER_P21		(1 << 21)
/** PIOC_PUER_P20 Pull-Up Enable **/
#define PIOC_PUER_P20		(1 << 20)
/** PIOC_PUER_P19 Pull-Up Enable **/
#define PIOC_PUER_P19		(1 << 19)
/** PIOC_PUER_P18 Pull-Up Enable **/
#define PIOC_PUER_P18		(1 << 18)
/** PIOC_PUER_P17 Pull-Up Enable **/
#define PIOC_PUER_P17		(1 << 17)
/** PIOC_PUER_P16 Pull-Up Enable **/
#define PIOC_PUER_P16		(1 << 16)
/** PIOC_PUER_P15 Pull-Up Enable **/
#define PIOC_PUER_P15		(1 << 15)
/** PIOC_PUER_P14 Pull-Up Enable **/
#define PIOC_PUER_P14		(1 << 14)
/** PIOC_PUER_P13 Pull-Up Enable **/
#define PIOC_PUER_P13		(1 << 13)
/** PIOC_PUER_P12 Pull-Up Enable **/
#define PIOC_PUER_P12		(1 << 12)
/** PIOC_PUER_P11 Pull-Up Enable **/
#define PIOC_PUER_P11		(1 << 11)
/** PIOC_PUER_P10 Pull-Up Enable **/
#define PIOC_PUER_P10		(1 << 10)
/** PIOC_PUER_P9 Pull-Up Enable **/
#define PIOC_PUER_P9		(1 << 9)
/** PIOC_PUER_P8 Pull-Up Enable **/
#define PIOC_PUER_P8		(1 << 8)
/** PIOC_PUER_P7 Pull-Up Enable **/
#define PIOC_PUER_P7		(1 << 7)
/** PIOC_PUER_P6 Pull-Up Enable **/
#define PIOC_PUER_P6		(1 << 6)
/** PIOC_PUER_P5 Pull-Up Enable **/
#define PIOC_PUER_P5		(1 << 5)
/** PIOC_PUER_P4 Pull-Up Enable **/
#define PIOC_PUER_P4		(1 << 4)
/** PIOC_PUER_P3 Pull-Up Enable **/
#define PIOC_PUER_P3		(1 << 3)
/** PIOC_PUER_P2 Pull-Up Enable **/
#define PIOC_PUER_P2		(1 << 2)
/** PIOC_PUER_P1 Pull-Up Enable **/
#define PIOC_PUER_P1		(1 << 1)
/** PIOC_PUER_P0 Pull-Up Enable **/
#define PIOC_PUER_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_pusr PUSR Pad Pull-up Status Register
@{*/

/** PIOC_PUSR_P31 Pull-Up Status **/
#define PIOC_PUSR_P31		(1 << 31)
/** PIOC_PUSR_P30 Pull-Up Status **/
#define PIOC_PUSR_P30		(1 << 30)
/** PIOC_PUSR_P29 Pull-Up Status **/
#define PIOC_PUSR_P29		(1 << 29)
/** PIOC_PUSR_P28 Pull-Up Status **/
#define PIOC_PUSR_P28		(1 << 28)
/** PIOC_PUSR_P27 Pull-Up Status **/
#define PIOC_PUSR_P27		(1 << 27)
/** PIOC_PUSR_P26 Pull-Up Status **/
#define PIOC_PUSR_P26		(1 << 26)
/** PIOC_PUSR_P25 Pull-Up Status **/
#define PIOC_PUSR_P25		(1 << 25)
/** PIOC_PUSR_P24 Pull-Up Status **/
#define PIOC_PUSR_P24		(1 << 24)
/** PIOC_PUSR_P23 Pull-Up Status **/
#define PIOC_PUSR_P23		(1 << 23)
/** PIOC_PUSR_P22 Pull-Up Status **/
#define PIOC_PUSR_P22		(1 << 22)
/** PIOC_PUSR_P21 Pull-Up Status **/
#define PIOC_PUSR_P21		(1 << 21)
/** PIOC_PUSR_P20 Pull-Up Status **/
#define PIOC_PUSR_P20		(1 << 20)
/** PIOC_PUSR_P19 Pull-Up Status **/
#define PIOC_PUSR_P19		(1 << 19)
/** PIOC_PUSR_P18 Pull-Up Status **/
#define PIOC_PUSR_P18		(1 << 18)
/** PIOC_PUSR_P17 Pull-Up Status **/
#define PIOC_PUSR_P17		(1 << 17)
/** PIOC_PUSR_P16 Pull-Up Status **/
#define PIOC_PUSR_P16		(1 << 16)
/** PIOC_PUSR_P15 Pull-Up Status **/
#define PIOC_PUSR_P15		(1 << 15)
/** PIOC_PUSR_P14 Pull-Up Status **/
#define PIOC_PUSR_P14		(1 << 14)
/** PIOC_PUSR_P13 Pull-Up Status **/
#define PIOC_PUSR_P13		(1 << 13)
/** PIOC_PUSR_P12 Pull-Up Status **/
#define PIOC_PUSR_P12		(1 << 12)
/** PIOC_PUSR_P11 Pull-Up Status **/
#define PIOC_PUSR_P11		(1 << 11)
/** PIOC_PUSR_P10 Pull-Up Status **/
#define PIOC_PUSR_P10		(1 << 10)
/** PIOC_PUSR_P9 Pull-Up Status **/
#define PIOC_PUSR_P9		(1 << 9)
/** PIOC_PUSR_P8 Pull-Up Status **/
#define PIOC_PUSR_P8		(1 << 8)
/** PIOC_PUSR_P7 Pull-Up Status **/
#define PIOC_PUSR_P7		(1 << 7)
/** PIOC_PUSR_P6 Pull-Up Status **/
#define PIOC_PUSR_P6		(1 << 6)
/** PIOC_PUSR_P5 Pull-Up Status **/
#define PIOC_PUSR_P5		(1 << 5)
/** PIOC_PUSR_P4 Pull-Up Status **/
#define PIOC_PUSR_P4		(1 << 4)
/** PIOC_PUSR_P3 Pull-Up Status **/
#define PIOC_PUSR_P3		(1 << 3)
/** PIOC_PUSR_P2 Pull-Up Status **/
#define PIOC_PUSR_P2		(1 << 2)
/** PIOC_PUSR_P1 Pull-Up Status **/
#define PIOC_PUSR_P1		(1 << 1)
/** PIOC_PUSR_P0 Pull-Up Status **/
#define PIOC_PUSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_abcdsr[0] ABCDSR[0] Peripheral Select Register
@{*/

