grevaillot/svd_tools/headers/ATSAM4S2C/pioc.h
/** @defgroup pioc_aimmr AIMMR Additional Interrupt Modes Mask Register
@{*/

/** PIOC_AIMMR_P31 IO Line Index **/
#define PIOC_AIMMR_P31		(1 << 31)
/** PIOC_AIMMR_P30 IO Line Index **/
#define PIOC_AIMMR_P30		(1 << 30)
/** PIOC_AIMMR_P29 IO Line Index **/
#define PIOC_AIMMR_P29		(1 << 29)
/** PIOC_AIMMR_P28 IO Line Index **/
#define PIOC_AIMMR_P28		(1 << 28)
/** PIOC_AIMMR_P27 IO Line Index **/
#define PIOC_AIMMR_P27		(1 << 27)
/** PIOC_AIMMR_P26 IO Line Index **/
#define PIOC_AIMMR_P26		(1 << 26)
/** PIOC_AIMMR_P25 IO Line Index **/
#define PIOC_AIMMR_P25		(1 << 25)
/** PIOC_AIMMR_P24 IO Line Index **/
#define PIOC_AIMMR_P24		(1 << 24)
/** PIOC_AIMMR_P23 IO Line Index **/
#define PIOC_AIMMR_P23		(1 << 23)
/** PIOC_AIMMR_P22 IO Line Index **/
#define PIOC_AIMMR_P22		(1 << 22)
/** PIOC_AIMMR_P21 IO Line Index **/
#define PIOC_AIMMR_P21		(1 << 21)
/** PIOC_AIMMR_P20 IO Line Index **/
#define PIOC_AIMMR_P20		(1 << 20)
/** PIOC_AIMMR_P19 IO Line Index **/
#define PIOC_AIMMR_P19		(1 << 19)
/** PIOC_AIMMR_P18 IO Line Index **/
#define PIOC_AIMMR_P18		(1 << 18)
/** PIOC_AIMMR_P17 IO Line Index **/
#define PIOC_AIMMR_P17		(1 << 17)
/** PIOC_AIMMR_P16 IO Line Index **/
#define PIOC_AIMMR_P16		(1 << 16)
/** PIOC_AIMMR_P15 IO Line Index **/
#define PIOC_AIMMR_P15		(1 << 15)
/** PIOC_AIMMR_P14 IO Line Index **/
#define PIOC_AIMMR_P14		(1 << 14)
/** PIOC_AIMMR_P13 IO Line Index **/
#define PIOC_AIMMR_P13		(1 << 13)
/** PIOC_AIMMR_P12 IO Line Index **/
#define PIOC_AIMMR_P12		(1 << 12)
/** PIOC_AIMMR_P11 IO Line Index **/
#define PIOC_AIMMR_P11		(1 << 11)
/** PIOC_AIMMR_P10 IO Line Index **/
#define PIOC_AIMMR_P10		(1 << 10)
/** PIOC_AIMMR_P9 IO Line Index **/
#define PIOC_AIMMR_P9		(1 << 9)
/** PIOC_AIMMR_P8 IO Line Index **/
#define PIOC_AIMMR_P8		(1 << 8)
/** PIOC_AIMMR_P7 IO Line Index **/
#define PIOC_AIMMR_P7		(1 << 7)
/** PIOC_AIMMR_P6 IO Line Index **/
#define PIOC_AIMMR_P6		(1 << 6)
/** PIOC_AIMMR_P5 IO Line Index **/
#define PIOC_AIMMR_P5		(1 << 5)
/** PIOC_AIMMR_P4 IO Line Index **/
#define PIOC_AIMMR_P4		(1 << 4)
/** PIOC_AIMMR_P3 IO Line Index **/
#define PIOC_AIMMR_P3		(1 << 3)
/** PIOC_AIMMR_P2 IO Line Index **/
#define PIOC_AIMMR_P2		(1 << 2)
/** PIOC_AIMMR_P1 IO Line Index **/
#define PIOC_AIMMR_P1		(1 << 1)
/** PIOC_AIMMR_P0 IO Line Index **/
#define PIOC_AIMMR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_esr ESR Edge Select Register
@{*/

/** PIOC_ESR_P31 Edge Interrupt Selection **/
#define PIOC_ESR_P31		(1 << 31)
/** PIOC_ESR_P30 Edge Interrupt Selection **/
#define PIOC_ESR_P30		(1 << 30)
/** PIOC_ESR_P29 Edge Interrupt Selection **/
#define PIOC_ESR_P29		(1 << 29)
/** PIOC_ESR_P28 Edge Interrupt Selection **/
#define PIOC_ESR_P28		(1 << 28)
/** PIOC_ESR_P27 Edge Interrupt Selection **/
#define PIOC_ESR_P27		(1 << 27)
/** PIOC_ESR_P26 Edge Interrupt Selection **/
#define PIOC_ESR_P26		(1 << 26)
/** PIOC_ESR_P25 Edge Interrupt Selection **/
#define PIOC_ESR_P25		(1 << 25)
/** PIOC_ESR_P24 Edge Interrupt Selection **/
#define PIOC_ESR_P24		(1 << 24)
/** PIOC_ESR_P23 Edge Interrupt Selection **/
#define PIOC_ESR_P23		(1 << 23)
/** PIOC_ESR_P22 Edge Interrupt Selection **/
#define PIOC_ESR_P22		(1 << 22)
/** PIOC_ESR_P21 Edge Interrupt Selection **/
#define PIOC_ESR_P21		(1 << 21)
/** PIOC_ESR_P20 Edge Interrupt Selection **/
#define PIOC_ESR_P20		(1 << 20)
/** PIOC_ESR_P19 Edge Interrupt Selection **/
#define PIOC_ESR_P19		(1 << 19)
/** PIOC_ESR_P18 Edge Interrupt Selection **/
#define PIOC_ESR_P18		(1 << 18)
/** PIOC_ESR_P17 Edge Interrupt Selection **/
#define PIOC_ESR_P17		(1 << 17)
/** PIOC_ESR_P16 Edge Interrupt Selection **/
#define PIOC_ESR_P16		(1 << 16)
/** PIOC_ESR_P15 Edge Interrupt Selection **/
#define PIOC_ESR_P15		(1 << 15)
/** PIOC_ESR_P14 Edge Interrupt Selection **/
#define PIOC_ESR_P14		(1 << 14)
/** PIOC_ESR_P13 Edge Interrupt Selection **/
#define PIOC_ESR_P13		(1 << 13)
/** PIOC_ESR_P12 Edge Interrupt Selection **/
#define PIOC_ESR_P12		(1 << 12)
/** PIOC_ESR_P11 Edge Interrupt Selection **/
#define PIOC_ESR_P11		(1 << 11)
/** PIOC_ESR_P10 Edge Interrupt Selection **/
#define PIOC_ESR_P10		(1 << 10)
/** PIOC_ESR_P9 Edge Interrupt Selection **/
#define PIOC_ESR_P9		(1 << 9)
/** PIOC_ESR_P8 Edge Interrupt Selection **/
#define PIOC_ESR_P8		(1 << 8)
/** PIOC_ESR_P7 Edge Interrupt Selection **/
#define PIOC_ESR_P7		(1 << 7)
/** PIOC_ESR_P6 Edge Interrupt Selection **/
#define PIOC_ESR_P6		(1 << 6)
/** PIOC_ESR_P5 Edge Interrupt Selection **/
#define PIOC_ESR_P5		(1 << 5)
/** PIOC_ESR_P4 Edge Interrupt Selection **/
#define PIOC_ESR_P4		(1 << 4)
/** PIOC_ESR_P3 Edge Interrupt Selection **/
#define PIOC_ESR_P3		(1 << 3)
/** PIOC_ESR_P2 Edge Interrupt Selection **/
#define PIOC_ESR_P2		(1 << 2)
/** PIOC_ESR_P1 Edge Interrupt Selection **/
#define PIOC_ESR_P1		(1 << 1)
/** PIOC_ESR_P0 Edge Interrupt Selection **/
#define PIOC_ESR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_lsr LSR Level Select Register
@{*/

/** PIOC_LSR_P31 Level Interrupt Selection **/
#define PIOC_LSR_P31		(1 << 31)
/** PIOC_LSR_P30 Level Interrupt Selection **/
#define PIOC_LSR_P30		(1 << 30)
/** PIOC_LSR_P29 Level Interrupt Selection **/
#define PIOC_LSR_P29		(1 << 29)
/** PIOC_LSR_P28 Level Interrupt Selection **/
#define PIOC_LSR_P28		(1 << 28)
/** PIOC_LSR_P27 Level Interrupt Selection **/
#define PIOC_LSR_P27		(1 << 27)
/** PIOC_LSR_P26 Level Interrupt Selection **/
#define PIOC_LSR_P26		(1 << 26)
/** PIOC_LSR_P25 Level Interrupt Selection **/
#define PIOC_LSR_P25		(1 << 25)
/** PIOC_LSR_P24 Level Interrupt Selection **/
#define PIOC_LSR_P24		(1 << 24)
/** PIOC_LSR_P23 Level Interrupt Selection **/
#define PIOC_LSR_P23		(1 << 23)
/** PIOC_LSR_P22 Level Interrupt Selection **/
#define PIOC_LSR_P22		(1 << 22)
/** PIOC_LSR_P21 Level Interrupt Selection **/
#define PIOC_LSR_P21		(1 << 21)
/** PIOC_LSR_P20 Level Interrupt Selection **/
#define PIOC_LSR_P20		(1 << 20)
/** PIOC_LSR_P19 Level Interrupt Selection **/
#define PIOC_LSR_P19		(1 << 19)
/** PIOC_LSR_P18 Level Interrupt Selection **/
#define PIOC_LSR_P18		(1 << 18)
/** PIOC_LSR_P17 Level Interrupt Selection **/
#define PIOC_LSR_P17		(1 << 17)
/** PIOC_LSR_P16 Level Interrupt Selection **/
#define PIOC_LSR_P16		(1 << 16)
/** PIOC_LSR_P15 Level Interrupt Selection **/
#define PIOC_LSR_P15		(1 << 15)
/** PIOC_LSR_P14 Level Interrupt Selection **/
#define PIOC_LSR_P14		(1 << 14)
/** PIOC_LSR_P13 Level Interrupt Selection **/
#define PIOC_LSR_P13		(1 << 13)
/** PIOC_LSR_P12 Level Interrupt Selection **/
#define PIOC_LSR_P12		(1 << 12)
/** PIOC_LSR_P11 Level Interrupt Selection **/
#define PIOC_LSR_P11		(1 << 11)
/** PIOC_LSR_P10 Level Interrupt Selection **/
#define PIOC_LSR_P10		(1 << 10)
/** PIOC_LSR_P9 Level Interrupt Selection **/
#define PIOC_LSR_P9		(1 << 9)
/** PIOC_LSR_P8 Level Interrupt Selection **/
#define PIOC_LSR_P8		(1 << 8)
/** PIOC_LSR_P7 Level Interrupt Selection **/
#define PIOC_LSR_P7		(1 << 7)
/** PIOC_LSR_P6 Level Interrupt Selection **/
#define PIOC_LSR_P6		(1 << 6)
/** PIOC_LSR_P5 Level Interrupt Selection **/
#define PIOC_LSR_P5		(1 << 5)
/** PIOC_LSR_P4 Level Interrupt Selection **/
#define PIOC_LSR_P4		(1 << 4)
/** PIOC_LSR_P3 Level Interrupt Selection **/
#define PIOC_LSR_P3		(1 << 3)
/** PIOC_LSR_P2 Level Interrupt Selection **/
#define PIOC_LSR_P2		(1 << 2)
/** PIOC_LSR_P1 Level Interrupt Selection **/
#define PIOC_LSR_P1		(1 << 1)
/** PIOC_LSR_P0 Level Interrupt Selection **/
#define PIOC_LSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_elsr ELSR Edge/Level Status Register
@{*/

