grevaillot/svd_tools/headers/ATSAM4S2C/pioc.h
/** PIOC_REHLSR_P31 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P31		(1 << 31)
/** PIOC_REHLSR_P30 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P30		(1 << 30)
/** PIOC_REHLSR_P29 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P29		(1 << 29)
/** PIOC_REHLSR_P28 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P28		(1 << 28)
/** PIOC_REHLSR_P27 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P27		(1 << 27)
/** PIOC_REHLSR_P26 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P26		(1 << 26)
/** PIOC_REHLSR_P25 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P25		(1 << 25)
/** PIOC_REHLSR_P24 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P24		(1 << 24)
/** PIOC_REHLSR_P23 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P23		(1 << 23)
/** PIOC_REHLSR_P22 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P22		(1 << 22)
/** PIOC_REHLSR_P21 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P21		(1 << 21)
/** PIOC_REHLSR_P20 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P20		(1 << 20)
/** PIOC_REHLSR_P19 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P19		(1 << 19)
/** PIOC_REHLSR_P18 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P18		(1 << 18)
/** PIOC_REHLSR_P17 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P17		(1 << 17)
/** PIOC_REHLSR_P16 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P16		(1 << 16)
/** PIOC_REHLSR_P15 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P15		(1 << 15)
/** PIOC_REHLSR_P14 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P14		(1 << 14)
/** PIOC_REHLSR_P13 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P13		(1 << 13)
/** PIOC_REHLSR_P12 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P12		(1 << 12)
/** PIOC_REHLSR_P11 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P11		(1 << 11)
/** PIOC_REHLSR_P10 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P10		(1 << 10)
/** PIOC_REHLSR_P9 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P9		(1 << 9)
/** PIOC_REHLSR_P8 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P8		(1 << 8)
/** PIOC_REHLSR_P7 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P7		(1 << 7)
/** PIOC_REHLSR_P6 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P6		(1 << 6)
/** PIOC_REHLSR_P5 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P5		(1 << 5)
/** PIOC_REHLSR_P4 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P4		(1 << 4)
/** PIOC_REHLSR_P3 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P3		(1 << 3)
/** PIOC_REHLSR_P2 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P2		(1 << 2)
/** PIOC_REHLSR_P1 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P1		(1 << 1)
/** PIOC_REHLSR_P0 Rising Edge/High-Level Interrupt Selection **/
#define PIOC_REHLSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_frlhsr FRLHSR Fall/Rise - Low/High Status Register
@{*/

/** PIOC_FRLHSR_P31 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P31		(1 << 31)
/** PIOC_FRLHSR_P30 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P30		(1 << 30)
/** PIOC_FRLHSR_P29 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P29		(1 << 29)
/** PIOC_FRLHSR_P28 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P28		(1 << 28)
/** PIOC_FRLHSR_P27 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P27		(1 << 27)
/** PIOC_FRLHSR_P26 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P26		(1 << 26)
/** PIOC_FRLHSR_P25 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P25		(1 << 25)
/** PIOC_FRLHSR_P24 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P24		(1 << 24)
/** PIOC_FRLHSR_P23 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P23		(1 << 23)
/** PIOC_FRLHSR_P22 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P22		(1 << 22)
/** PIOC_FRLHSR_P21 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P21		(1 << 21)
/** PIOC_FRLHSR_P20 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P20		(1 << 20)
/** PIOC_FRLHSR_P19 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P19		(1 << 19)
/** PIOC_FRLHSR_P18 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P18		(1 << 18)
/** PIOC_FRLHSR_P17 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P17		(1 << 17)
/** PIOC_FRLHSR_P16 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P16		(1 << 16)
/** PIOC_FRLHSR_P15 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P15		(1 << 15)
/** PIOC_FRLHSR_P14 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P14		(1 << 14)
/** PIOC_FRLHSR_P13 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P13		(1 << 13)
/** PIOC_FRLHSR_P12 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P12		(1 << 12)
/** PIOC_FRLHSR_P11 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P11		(1 << 11)
/** PIOC_FRLHSR_P10 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P10		(1 << 10)
/** PIOC_FRLHSR_P9 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P9		(1 << 9)
/** PIOC_FRLHSR_P8 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P8		(1 << 8)
/** PIOC_FRLHSR_P7 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P7		(1 << 7)
/** PIOC_FRLHSR_P6 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P6		(1 << 6)
/** PIOC_FRLHSR_P5 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P5		(1 << 5)
/** PIOC_FRLHSR_P4 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P4		(1 << 4)
/** PIOC_FRLHSR_P3 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P3		(1 << 3)
/** PIOC_FRLHSR_P2 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P2		(1 << 2)
/** PIOC_FRLHSR_P1 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P1		(1 << 1)
/** PIOC_FRLHSR_P0 Edge/Level Interrupt Source Selection **/
#define PIOC_FRLHSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_locksr LOCKSR Lock Status
@{*/

/** PIOC_LOCKSR_P31 Lock Status **/
#define PIOC_LOCKSR_P31		(1 << 31)
/** PIOC_LOCKSR_P30 Lock Status **/
#define PIOC_LOCKSR_P30		(1 << 30)
/** PIOC_LOCKSR_P29 Lock Status **/
#define PIOC_LOCKSR_P29		(1 << 29)
/** PIOC_LOCKSR_P28 Lock Status **/
#define PIOC_LOCKSR_P28		(1 << 28)
/** PIOC_LOCKSR_P27 Lock Status **/
#define PIOC_LOCKSR_P27		(1 << 27)
/** PIOC_LOCKSR_P26 Lock Status **/
#define PIOC_LOCKSR_P26		(1 << 26)
/** PIOC_LOCKSR_P25 Lock Status **/
#define PIOC_LOCKSR_P25		(1 << 25)
/** PIOC_LOCKSR_P24 Lock Status **/
#define PIOC_LOCKSR_P24		(1 << 24)
/** PIOC_LOCKSR_P23 Lock Status **/
#define PIOC_LOCKSR_P23		(1 << 23)
/** PIOC_LOCKSR_P22 Lock Status **/
#define PIOC_LOCKSR_P22		(1 << 22)
/** PIOC_LOCKSR_P21 Lock Status **/
#define PIOC_LOCKSR_P21		(1 << 21)
/** PIOC_LOCKSR_P20 Lock Status **/
#define PIOC_LOCKSR_P20		(1 << 20)
/** PIOC_LOCKSR_P19 Lock Status **/
#define PIOC_LOCKSR_P19		(1 << 19)
/** PIOC_LOCKSR_P18 Lock Status **/
#define PIOC_LOCKSR_P18		(1 << 18)
/** PIOC_LOCKSR_P17 Lock Status **/
#define PIOC_LOCKSR_P17		(1 << 17)
/** PIOC_LOCKSR_P16 Lock Status **/
#define PIOC_LOCKSR_P16		(1 << 16)
/** PIOC_LOCKSR_P15 Lock Status **/
#define PIOC_LOCKSR_P15		(1 << 15)
/** PIOC_LOCKSR_P14 Lock Status **/
#define PIOC_LOCKSR_P14		(1 << 14)
/** PIOC_LOCKSR_P13 Lock Status **/
#define PIOC_LOCKSR_P13		(1 << 13)
/** PIOC_LOCKSR_P12 Lock Status **/
#define PIOC_LOCKSR_P12		(1 << 12)
/** PIOC_LOCKSR_P11 Lock Status **/
#define PIOC_LOCKSR_P11		(1 << 11)
/** PIOC_LOCKSR_P10 Lock Status **/
#define PIOC_LOCKSR_P10		(1 << 10)
/** PIOC_LOCKSR_P9 Lock Status **/
#define PIOC_LOCKSR_P9		(1 << 9)
/** PIOC_LOCKSR_P8 Lock Status **/
#define PIOC_LOCKSR_P8		(1 << 8)
/** PIOC_LOCKSR_P7 Lock Status **/
#define PIOC_LOCKSR_P7		(1 << 7)
/** PIOC_LOCKSR_P6 Lock Status **/
#define PIOC_LOCKSR_P6		(1 << 6)
/** PIOC_LOCKSR_P5 Lock Status **/
#define PIOC_LOCKSR_P5		(1 << 5)
/** PIOC_LOCKSR_P4 Lock Status **/
#define PIOC_LOCKSR_P4		(1 << 4)
/** PIOC_LOCKSR_P3 Lock Status **/
#define PIOC_LOCKSR_P3		(1 << 3)
/** PIOC_LOCKSR_P2 Lock Status **/
#define PIOC_LOCKSR_P2		(1 << 2)
/** PIOC_LOCKSR_P1 Lock Status **/
#define PIOC_LOCKSR_P1		(1 << 1)
/** PIOC_LOCKSR_P0 Lock Status **/
#define PIOC_LOCKSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioc_wpmr WPMR Write Protection Mode Register
@{*/


