grevaillot/svd_tools/headers/ATSAM4S2C/pioc.h
#define PIOC_WPMR_WPKEY_SHIFT		8
#define PIOC_WPMR_WPKEY_MASK		0xffffff
/** @defgroup pioc_wpmr_wpkey WPKEY Write Protection Key
@{*/
/**@}*/

/** PIOC_WPMR_WPEN Write Protection Enable **/
#define PIOC_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup pioc_wpsr WPSR Write Protection Status Register
@{*/


#define PIOC_WPSR_WPVSRC_SHIFT		8
#define PIOC_WPSR_WPVSRC_MASK		0xffff
/** @defgroup pioc_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** PIOC_WPSR_WPVS Write Protection Violation Status **/
#define PIOC_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup pioc_schmitt SCHMITT Schmitt Trigger Register
@{*/

/** PIOC_SCHMITT_SCHMITT31 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT31		(1 << 31)
/** PIOC_SCHMITT_SCHMITT30 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT30		(1 << 30)
/** PIOC_SCHMITT_SCHMITT29 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT29		(1 << 29)
/** PIOC_SCHMITT_SCHMITT28 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT28		(1 << 28)
/** PIOC_SCHMITT_SCHMITT27 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT27		(1 << 27)
/** PIOC_SCHMITT_SCHMITT26 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT26		(1 << 26)
/** PIOC_SCHMITT_SCHMITT25 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT25		(1 << 25)
/** PIOC_SCHMITT_SCHMITT24 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT24		(1 << 24)
/** PIOC_SCHMITT_SCHMITT23 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT23		(1 << 23)
/** PIOC_SCHMITT_SCHMITT22 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT22		(1 << 22)
/** PIOC_SCHMITT_SCHMITT21 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT21		(1 << 21)
/** PIOC_SCHMITT_SCHMITT20 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT20		(1 << 20)
/** PIOC_SCHMITT_SCHMITT19 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT19		(1 << 19)
/** PIOC_SCHMITT_SCHMITT18 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT18		(1 << 18)
/** PIOC_SCHMITT_SCHMITT17 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT17		(1 << 17)
/** PIOC_SCHMITT_SCHMITT16 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT16		(1 << 16)
/** PIOC_SCHMITT_SCHMITT15 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT15		(1 << 15)
/** PIOC_SCHMITT_SCHMITT14 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT14		(1 << 14)
/** PIOC_SCHMITT_SCHMITT13 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT13		(1 << 13)
/** PIOC_SCHMITT_SCHMITT12 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT12		(1 << 12)
/** PIOC_SCHMITT_SCHMITT11 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT11		(1 << 11)
/** PIOC_SCHMITT_SCHMITT10 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT10		(1 << 10)
/** PIOC_SCHMITT_SCHMITT9 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT9		(1 << 9)
/** PIOC_SCHMITT_SCHMITT8 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT8		(1 << 8)
/** PIOC_SCHMITT_SCHMITT7 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT7		(1 << 7)
/** PIOC_SCHMITT_SCHMITT6 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT6		(1 << 6)
/** PIOC_SCHMITT_SCHMITT5 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT5		(1 << 5)
/** PIOC_SCHMITT_SCHMITT4 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT4		(1 << 4)
/** PIOC_SCHMITT_SCHMITT3 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT3		(1 << 3)
/** PIOC_SCHMITT_SCHMITT2 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT2		(1 << 2)
/** PIOC_SCHMITT_SCHMITT1 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT1		(1 << 1)
/** PIOC_SCHMITT_SCHMITT0 Schmitt Trigger Control **/
#define PIOC_SCHMITT_SCHMITT0		(1 << 0)

/**@}*/

/** @defgroup pioc_pcmr PCMR Parallel Capture Mode Register
@{*/

/** PIOC_PCMR_FRSTS Parallel Capture Mode First Sample **/
#define PIOC_PCMR_FRSTS		(1 << 11)
/** PIOC_PCMR_HALFS Parallel Capture Mode Half Sampling **/
#define PIOC_PCMR_HALFS		(1 << 10)
/** PIOC_PCMR_ALWYS Parallel Capture Mode Always Sampling **/
#define PIOC_PCMR_ALWYS		(1 << 9)

#define PIOC_PCMR_DSIZE_SHIFT		4
#define PIOC_PCMR_DSIZE_MASK		0x03
/** @defgroup pioc_pcmr_dsize DSIZE Parallel Capture Mode Data Size
@{*/
/**@}*/

/** PIOC_PCMR_PCEN Parallel Capture Mode Enable **/
#define PIOC_PCMR_PCEN		(1 << 0)

/**@}*/

/** @defgroup pioc_pcier PCIER Parallel Capture Interrupt Enable Register
@{*/

/** PIOC_PCIER_RXBUFF Reception Buffer Full Interrupt Enable **/
#define PIOC_PCIER_RXBUFF		(1 << 3)
/** PIOC_PCIER_ENDRX End of Reception Transfer Interrupt Enable **/
#define PIOC_PCIER_ENDRX		(1 << 2)
/** PIOC_PCIER_OVRE Parallel Capture Mode Overrun Error Interrupt Enable **/
#define PIOC_PCIER_OVRE		(1 << 1)
/** PIOC_PCIER_DRDY Parallel Capture Mode Data Ready Interrupt Enable **/
#define PIOC_PCIER_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioc_pcidr PCIDR Parallel Capture Interrupt Disable Register
@{*/

/** PIOC_PCIDR_RXBUFF Reception Buffer Full Interrupt Disable **/
#define PIOC_PCIDR_RXBUFF		(1 << 3)
/** PIOC_PCIDR_ENDRX End of Reception Transfer Interrupt Disable **/
#define PIOC_PCIDR_ENDRX		(1 << 2)
/** PIOC_PCIDR_OVRE Parallel Capture Mode Overrun Error Interrupt Disable **/
#define PIOC_PCIDR_OVRE		(1 << 1)
/** PIOC_PCIDR_DRDY Parallel Capture Mode Data Ready Interrupt Disable **/
#define PIOC_PCIDR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioc_pcimr PCIMR Parallel Capture Interrupt Mask Register
@{*/

/** PIOC_PCIMR_RXBUFF Reception Buffer Full Interrupt Mask **/
#define PIOC_PCIMR_RXBUFF		(1 << 3)
/** PIOC_PCIMR_ENDRX End of Reception Transfer Interrupt Mask **/
#define PIOC_PCIMR_ENDRX		(1 << 2)
/** PIOC_PCIMR_OVRE Parallel Capture Mode Overrun Error Interrupt Mask **/
#define PIOC_PCIMR_OVRE		(1 << 1)
/** PIOC_PCIMR_DRDY Parallel Capture Mode Data Ready Interrupt Mask **/
#define PIOC_PCIMR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioc_pcisr PCISR Parallel Capture Interrupt Status Register
@{*/

/** PIOC_PCISR_RXBUFF  **/
#define PIOC_PCISR_RXBUFF		(1 << 3)
/** PIOC_PCISR_ENDRX  **/
#define PIOC_PCISR_ENDRX		(1 << 2)
/** PIOC_PCISR_OVRE Parallel Capture Mode Overrun Error **/
#define PIOC_PCISR_OVRE		(1 << 1)
/** PIOC_PCISR_DRDY Parallel Capture Mode Data Ready **/
#define PIOC_PCISR_DRDY		(1 << 0)

/**@}*/

/** @defgroup pioc_pcrhr PCRHR Parallel Capture Reception Holding Register
@{*/


#define PIOC_PCRHR_RDATA_SHIFT		0
#define PIOC_PCRHR_RDATA_MASK		0xffffffff
/** @defgroup pioc_pcrhr_rdata RDATA Parallel Capture Mode Reception Data
@{*/
/**@}*/


/**@}*/
